{    
    "John Deere - Ana": {
        "title": "John Deere - Ana",
        "summary": "Experiencia de Realidad Aumentada con la asistente virtual de John Deere",
        "description": [
            "Este proyecto es una experiencia de realidad aumentada para el lanzamiento de la asistente virtual de John Deere.\n\n",
            "La experiencia consiste en una aplicaci칩n web que permite a los usuarios interactuar con la asistente virtual de John Deere, Ana, y compartir una captura de su experiencia en redes sociales.\n\n",
            "La aplicaci칩n fue desarrollada con Three.JS y la API WebXR de Javascript.\n\n",
            "Fue un proyecto muy interesante y me llevo a investigar much칤simo sobre la API y el funcionamiento interno de WebXR y el propio navegador (termin칠 leyendo el c칩digo fuente de Chromium 游땳).\n\n",
            "Incluso a escrib칤 un par de art칤culos sobre problemas que surgieron en este proyecto. Puedes leerlos en mi perfil de Medium."
        ],
        "image": "./projects/johndeere-ana.png",
        "links": [
            { "name": "Website", "link": "https://avatardigital.deere.com/" }
        ],
        "responsibilities": [
            "Dise침o y desarrollo de la aplicaci칩n web (Three.JS)",
            "Investigaci칩n y desarrollo de la experiencia de realidad aumentada (WebXR)",
            "Documentaci칩n de la aplicaci칩n web (JSDoc)"
        ]
    },

    "Wiz Light Manager": {
        "title": "Wiz Lights Manager",
        "summary": "Librer칤a de Typescript y aplicaci칩n de Electron para gestionar luces inteligentes de Wiz.",
        "description": [
            "Wiz Light Manager es una librer칤a de Typescript y una aplicaci칩n de Electron para gestionar luces inteligentes de Wiz a trav칠s de una API UDP que hostea cada luz.\n\n",
            "Es un proyecto que comenc칠 en Rust, pero debido a mi falta de experiencia en Rust, decid칤 cambiar a Typescript.\n\n",
            "La librer칤a de Typescript es una API para interactuar con las luces de Wiz.\n",
            "Permite descubrir luces en la red local, cambiar su color, brillo, temperatura de color, etc.\n\n",
            "La aplicaci칩n de Electron es una interfaz gr치fica para la librer칤a.\n\n",
            "Fue un proyecto que surgi칩 de una necesidad personal y termin칩 siendo un proyecto muy interesante y 칰til."
        ],
        "image": "./projects/wiz-light-manager.png",
        "links": [
            { "name": "Github", "link": "https://github.com/jlannoo/wiz-lights-manager" }
        ],
        "responsibilities": [
            "Investigaci칩n sobre APIs UDP y MQTT",
            "Dise침o y desarrollo de la librer칤a de Typescript",
            "Dise침o y desarrollo de la aplicaci칩n de Electron"
        ]
    },


    "Solucionadores": {
        "title": "WD-40 Club de Solucionadores",
        "summary": "Red social / blog comunitario, desarrollado en Next.JS para WD-40 LATAM.",
        "description": [
            "Red social / blog comunitario donde la gente puede compartir sus experiencias y consejos utilizando los productos de WD-40.\n\n",
            "Crear este sitio fue una experiencia interesante. El equipo entero se lanz칩 a hacer un proyecto ambicioso con tecnolog칤as nuevas y deadlines estrictas.\n\n",
            "Termin칩 siendo una gran experiencia de aprendizaje y un buen producto final."
        ],
        "image": "./projects/solucionadores.png",
        "links": [
            { "name": "Website", "link": "https://solucionadores.wd40.lat" }
        ],
        "responsibilities": [
            "An치lisis y dise침o funcional",
            "Implementaci칩n y dise침o de estructura de base de datos (MySQL)",
            "Migraciones de base de datos",
            "Desarrollo backend (Node.JS)",
            "Documentaci칩n backend (JSDoc, Swagger)",
            "Testing de integraci칩n",
            "Deploy de la aplicaci칩n (Apache, Nginx)"
        ]
    },


    "SistemaAenima": {
        "title": "SistemaAenima",
        "summary": "Rehacer el frontend y refactorizaci칩n completa del backend del sistema interno de gesti칩n de presupuestos de la empresa.",
        "description": [
            "En este proyecto rehicimos el frontend del sistema interno de gesti칩n de presupuesto de la empresa y mejoramos su backend.\n\n",
            "El sistema original estaba hecho en Angular.JS, era lento y dif칤cil de mantener. Adem치s, aproximadamente la mitad no funcionaba como deb칤a.\n\n",
            "El nuevo fue desarrollada en React y fue un gran aprendizaje. Tambi칠n fue una buena oportunidad para mejorar su funcionalidad y experiencia de usuario.\n\n",
            "El backend y la base de datos necesitaban un redise침o, refactorizaci칩n y funcionalidades agregadas.\n\n\n",
            "Obviamente, al ser un sistema interno de la empresa, solo puedo hablar sobre mi experiencia durante el desarrollo y no puedo proveer mucha informaci칩n sobre 칠l."
        ],
        "image": "./projects/sistemaenima.png",
        "links": [],
        "responsibilities": [
            "Dise침o UX e implementaci칩n",
            "Desarrollo frontend (React)",
            "Desarrollo backend (Node.JS)",
            "Redise침o e implementaci칩n de base de datos",
            "Documentaci칩n de backend"
        ]
    },

    "GameOfLife": {
        "title": "拘뮉샤 Juego de la Vida 拘뫡샥",
        "summary": "Implementaci칩n del Juego de la Vida de Conway en Typescript y p5.js. Con hex치gonos 拘뫡샥!",
        "description": [
            "Implementaci칩n del Juego de la Vida de Conway en Typescript y p5.js.\n\n",
            "Decid칤 hacerlo con hex치gonos en lugar de cuadrados porque me pareci칩 m치s interesante visualmente.\n",
            "Adem치s de que ya hab칤a hecho una implementaci칩n con cuadrados en el pasado.\n\n",
            "Fue un proyecto divertido y me permiti칩 aprender sobre coordenadas hexagonales y c칩mo implementar un juego de la vida con ellas."
        ],
        "image": "./projects/hexagonal-game-of-life.png",
        "links": [
            { "name": "Github", "link": "https://www.github.com/jlannoo/hexagonal-game-of-life" },
            { "name": "Website", "link": "https://jlannoo.github.io/Hexagonal-Game-of-Life" }
        ],
        "responsibilities": [
            "Desarrollo frontend (Typescript, p5.js)",
            "Dise침o frontend",
            "Investigaci칩n de coordenadas hexagonales"
        ]
    },


    "PixelChat": {
        "title": "PixelChat",
        "summary": "Chat en vivo y dibujar con p칤xeles con otras personas!",
        "description": [
            "Un proyecto personal que desarroll칠 con Vanilla JS y SocketIO para aprender sobre websockets.\n\n",
            "Comenc칠 con un chat en vivo porque es el ejercicio cl치sico de ejemplo como primer proyecto con websockets.\n",
            "Pero pronto me di cuenta de que hacer solamente un chat ser칤a un poco aburrido, as칤 que pens칠 en hacerlo m치s interesante.\n\n",
            "Me interes칩 la idea de poder dibujar con las personas de la sala.\n",
            "Previamente, hab칤a creado un bot de Discord donde los usuarios pod칤an dibujar en un lienzo de 25x25 p칤xeles, as칤 que decid칤 agregar el mismo concepto\n\n",
            "Estoy satisfecho con la experiencia de desarrollo y el producto final."
        ],
        "image": "./projects/pixelchat.png",
        "links": [
            { "name": "Github", "link": "https://github.com/jlannoo/pixelchat" },
            { "name": "Website", "link": "https://pixelchat.jlannoo.dev/" }
        ],
        "responsibilities": [
            "Desarrollo backend (Node JS & Socket.IO)",
            "Desarrollo frontend (Vanilla JS)",
            "Dise침o frontend",
            "Deploy de aplicaci칩n (Railway)"
        ]
    },


    "EzReachFlexitapa": {
        "title": "EZ-Reach & Flexitapa",
        "summary": "Minijuego desarrollado con P5.JS para una campa침a de muestras con descuentos como recompensa para productos de WD-40.",
        "description":[
            "Este proyecto fue una campa침a publicitaria para productos de WD-40 donde la gente pod칤a.\n\n",
            "Yo desarroll칠 los minijuegos con P5.JS y las landing pages que los rodean fueron desarrolladas por un compa침ero con React.\n",
            "Estos juegos fueron adem치s usados en una expo en vivo, en un stand de WD-40, en forma de Progressive Web App. Se organiz칩 un concurso donde los asistentes pod칤an recibir a칰n m치s premios.\n\n",
            "Fue un proyecto distinto y divertido. No frecuentemente se puede trabajar en videojuegos en el desarrollo web."
        ],
        "image": "./projects/ezreach+flexitapa.png",
        "links": [
            { "name": "Website", "link": "https://samplingflexitapa.wd40.lat/" },
            { "name": "Website", "link": "https://ezreach.wd40.lat" }
        ],
        "responsibilities": [
            "Dise침o y desarrollo de videojuegos (P5.JS)",
            "Desarrollo de Progresive Web App"
        ]
    },
    

    "CanvasASCII": {
        "title": "Canvas ASCII",
        "summary": "Una herramienta de manipulaci칩n de im치genes que convierte im치genes a ASCII art. Hecha con HTML5 canvas.",
        "description": [
            "Una simple herramienta de generaci칩n de ASCII art de im치genes hecha con HTML5 Canvas.\n\n",
            "Tambi칠n permite manipular otros aspectos de la imagen como brillo, tama침o de p칤xel, profundidad de color, etc.\n\n",
            "Hice este proyecto para aprender sobre HTML5 Canvas y c칩mo usarlo para hacer procesamiento de im치genes.\n\n",
            "Fue un proyecto divertido y aprend칤 mucho sobre Canvas y procesamiento de im치genes."
        ],
        "image": "./projects/canvas-ascii.png",
        "links": [
            { "name": "Github", "link": "https://github.com/jlannoo/CanvasASCII" },
            { "name": "Website", "link": "https://canvas-ascii.jlannoo.dev/" }
        ],
        "responsibilities": [
            "Desarrollo Frontentd (Vanilla JS)",
            "Dise침o Frontend",
            "Investigaci칩n de HTML5 Canvas",
            "Investigaci칩n de procesamiento de im치genes"
        ]
    },


    "SvelteQ&A": {
        "title": "Svelte Q&A",
        "summary": "Una aplicaci칩n de Q&A hecha con SvelteKit, Planetscale, Prisma y deployeada en Vercel.",
        "description": [
            "Aplicaci칩n simple de preguntas y respuestas an칩nimas, hecha para familiarizarme con SvelteKit.\n\n",
            "Fue un proyecto r치pido que hice en unas pocas horas. No es el mejor c칩digo que he escrito, pero fue una buena manera de hacer algo en un framework con el que no estaba acostumbrado a trabajar.\n\n",
            "Adem치s, lo utilic칠 para probar Planetscale y Prisma.\n\n",
            "Todas estas son tecnolog칤as geniales que me permitieron hacer este proyecto en muy poco tiempo y de una manera muy estable y confiable."
        ],
        "image": "./projects/svelte-qna.png",
        "links": [
            { "name": "Github", "link": "https://github.com/jlannoo/svelte-qna"},
            { "name": "Website", "link": "https://qna.jlannoo.dev/" }
        ],
        "responsibilities": [
            "Desarrollo frontend (SvelteKit)",
            "Desarrollo backend (SvelteKit)",
            "Implementaci칩n y dise침o de base de datos (Planetscale, Prisma)",
            "Deploy de aplicaci칩n (Vercel)"
        ]
    },


    "Formlic": {
        "title": "Formlic",
        "summary": "Un \"formulario como servicio\" de c칩digo abierto para crear y gestionar endpoints de formulario para aplicaciones web.",
        "description":[
            "Inici칠 el proyecto porque no estaba conforme con c칩mo funcionaban la mayor칤a de los servicios de formularios.\n",
            "Quer칤a crear un servicio que sea sencillo de usar, tenga una buena UI y sea de c칩digo abierto.\n\n",
            "Puedes crear un formulario, recibir un enlace a 칠l y enviar POST requests, el sistema almacenar치 los datos y los enviar치 por mail al email vinculado a la cuenta.\n\n",
            "El proyecto apunta a estar preparado para usar en un entorno de producci칩n, al menos para mis usos personales."
        ],
        "image": "./projects/formlic.png",
        "links": [],
        "WIP": true,
        "responsibilities": [
            "An치lisis y dise침o funcional",
            "Desarrollo frontend (Next.JS)",
            "Desarrollo backend (Node.JS + tRPC)",
            "Redise침o e implementaci칩n de base de datos (MongoDB + Prisma)",
            "Migraciones de base de datos",
            "Documentaci칩n backend (JSDoc + Swagger)",
            "Testing de integraci칩n",
            "Deploy de aplicaci칩n (Railway)"
        ]
    },
    

    "IntegralsCheatsheet": {
        "title": "Integrals Cheatsheet",
        "summary": "Una lista de integrales com칰nmente usadas lista para imprimir y con integraci칩n de Wolfram Alpha. Hecha para aprender Astro.",
        "description": [
            "Este proyecto fue creado principalmente para aprender Astro y c칩mo usarlo para crear sitios sencillos, livianos, r치pidos y generados est치ticamente.\n\n",
            "Lo hice mientras estudiaba para mi examen de C치lculo III. Fue una gran forma de aprender Astro y sus caracter칤sticas."
        ],
        "image": "./projects/integrals.png",
        "links": [
            { "name": "Github", "link": "https://www.github.com/jlannoo/integrals-cheatsheet" },
            { "name": "Website", "link": "https://integrals.jlannoo.dev" }
        ],
        "responsibilities": [
            "Aprender Astro",
            "Investigaci칩n de integrales"
        ]
    }
}   